"""TrainToBangkok"""
#list ของสถานีต่างๆในสาย
blue = ["หลักสอง", "บางแค", "ภาษีเจริญ", "เพชรเกษม 48", ("บางหว้า สายน้ำเงิน", "บางหว้า สายฟ้า") \
          , "บางไผ่", "ท่าพระ", "จรัญฯ 13", "ไฟฉาย", "บางขุนนนท์", "บางยี่ขัน", "สิรินธร", "บางพลัด" \
          ,"บางอ้อ", "บางโพ", ("เตาปูน สายน้ำเงิน", "เตาปูน สายม่วง"), \
          ("บางซี่อ", "สถานีกลางกรุงเทพอภิวัฒน์ซ้าย", "สถานีกลางกรุงเทพอภิวัฒน์ขวา"), "กำแพงเพชร" \
          , ("สวนจตุจักร", "หมอชิต"), ("พหลโยธิน", "ห้าแยกลาดพร้าว"), \
          ("ลาดพร้าว สายน้ำเงิน", "ลาดพร้าว สายเหลือง"), "รัชดาภิเษก", "สุทธิสาร", "ห้วยขวาง" \
          , "ศูนย์วัฒนธรรมแห่งประเทศไทย", "พระราม 9",("เพชรบุรี", "มักกะสัน"), "สุขุมวิท" \
          , ("พร้อมพงษ์", "อโศก"), "ศูนย์ประชุมแห่งชาติสิริกิติ์", "คลองเตย", "ลุมพินี" \
          , ("สีลม", "ศาลาแดง"), "สามย่าน", "หัวลำโพง", "วัดมังกร", "สามยอด", "สนามไชย", "อิสรภาพ"]

lightblue = [("บางหว้า สายฟ้า", "บางหว้า สายน้ำเงิน"), "วุฒากาศ", ("ตลาดพลู", "ราชพฤกษ์") \
             , "โพธิ์นิมิตร", "วงเวียนใหญ่", ("กรุงธนบุรี สายฟ้า", "กรุงธนบุรี สายส้ม") \
             , "สะพานตากสิน", "สุรศักดิ์", "เซนต์หลุยส์", ("ช่องนนทรี", "สาทร"), \
            ("ศาลาแดง", "สีลม"), "ราชดำริ", ("สยาม สายฟ้า", "สยาม สายเขียว"), "สนามกีฬาแห่งชาติ"]

orange = ["คลองสาน", "เจริญนคร", ("กรุงธนบุรี สายส้ม", "กรุงธนบุรี สายฟ้า")]

littleyellow = [("ราชพฤกษ์", "ตลาดพลู"), "สะพานพระราม 3", "เจริญราษฎร์", "สะพานพระราม 9" \
                , "วัดดอกไม้", "วัดปริวาส", "วัดด่าน", "นราราม 3", "ถนนจันทน์", "เทคนิคกรุงเทพ" \
                , "อาคารสงเคราะห์", ("สาทร", "ช่องนนทรี")]

purple = ["คลองบางไผ่", "ตลาดบางใหญ่", "สามแยกบางใหญ่", "บางพลู", "บางรักใหญ่" \
          , "บางรักน้อยท่าอิฐ", "ไทรม้า", "สะพานพระนั่งเหล้า", "แยกนนทบุรี 1", "บางกระสอ" \
          , ("ศูนย์ราชการนนทบุรี สายม่วง", "ศูนย์ราชการนนทบุรี สายชมพู"), "กระทรวงสาธารณสุข" \
          , "แยกติวานนท์", "วงศ์สว่าง", ("บางซ่อน สายม่วง", "บางซ่อน สายแดง") \
          , ("เตาปูน สายม่วง", "เตาปูน สายน้ำเงิน")]

leftred = ["ตลิ่งชัน", "บางบำหรุ", "บางกรวย", "สะพานพระราม 6" \
           , ("บางซ่อน สายแดง", "บางซ่อน สายม่วง") \
           , ("สถานีกลางกรุงเทพอภิวัฒน์ซ้าย", "สถานีกลางกรุงเทพอภิวัฒน์ขวา", "บางซี่อ")]

rightred = [( "สถานีกลางกรุงเทพอภิวัฒน์ขวา", "สถานีกลางกรุงเทพอภิวัฒน์ซ้าย", "บางซี่อ") \
            , "จตุจักร", "วัดเสมียนนารี", "บางเขน", "ทุ่งสองห้อง" \
            , ("หลักสี่ สายแดง", "หลีกสี่ สายชมพู"), "การเคหะฯ", "ดอนเมือง", "หลักหก", "รังสิต"]

green = ["คูคต", "แยก คปอ", "พิพิธภัณฑ์กองทัพอากาศ", "โรงพยาบาลภูมิพลอดุลยเดช", "สะพานใหม่" \
         , " สายหยุด", "พหลโยธิน 59", ("วัดพระศรีมหาธาตุ สายเขียว", "วัดพระศรีมหาธาตุ สายชมพู") \
         ,"กรมทหารราบที่ 11", "บางบัว", "กรมป่าไม้", "มหาวิทยาลัยเกษตรศาสตร์", "เสนานิคม" \
         , "รัชโยธิน", "พหลโยธิน 24", ("ห้าแยกลาดพร้าว","พหลโยธิน"), ("หมอชิต", "สวนจตุจักร") \
         , "สะพานควาย", "เสนาร่วม", "อารีย์", "สนามเป้า", "อนุสาวรีย์ชัยสมรภูมิ" \
         , ("พญาไทย สายเขียว", "พญาไทย สายดำ"), "ราชเทวี", ("สยาม สายเขียว", "สยาม สายฟ้า") \
         , "ชิดลม", "เพลินจิต", "นานา", ("อโศก", "สุขุมวิท"), "พร้อมพงษ์", "ทองหล่อ", "เอกมัย" \
         , "พระโขนง", "อ่อนนุช", "บางจาก", "ปุณณวิถี", "อุดมสุข", "บางนา", "แบริ่ง" \
         , ("สำโรง สายเขียว", "สำโรง สาย เหลื่อง"), "ปู่เจ้า", "ช้างเอราวัณ", "โรงเรียนนายเรือ" \
         , "ปากน้ำ", "ศรีนครินทร์", "แพรกษา", "สายลวด", "เคหะฯ"]

pink = [("ศูนย์ราชการนนทยุรี สายชมพู", "ศูนย์ราชการนนทยุรี สายม่วง"), "แคราย", "สนามบินน้ำ" \
        , "สามัคคี", "กรมชลประทาน", "แยกปากเกร็ด", "เลี่ยงเมืองปากเกร็ด", "แจ้งวัฒนะปากเกร็ด 28" \
        , "เมืองทองธานี", "แจ้งวัฒนะ 14", "ศูนย์ราชการเฉลิมพระเกียรติ", "โทรคมนาคม" \
        , ("หลักสี่ สายชมพู", "หลักสี่ สายแดง"), "ราชภัฎพระนครเหนือ" \
        , ("วัดพระศรีมหาธาตุ สายชมพู", "วัดพระศรีมหาธาตุ สายเขียว"), "รามอินทรา 3", "ลาดปลาเค้า" \
        , "รามอินทรา กม.4", "มัยลาภ", "วัชรพล", "รามอินทรา กม.6", "คู้บอน", "รามอินทรา กม.9" \
        , "วงแหวนรามอินทรา", "นพรัตน์", "บางชัน", "เศรษบุตรบำเพ็ญ", "ตลาดมีนบุรี", "มีนบุรี"]

yellow = [("ลาดพร้าว สายเหลือง", "ลาดพร้าว สายน้ำเงิน"), "ภาวนา", "โชคชัย 4", "ลาดพร้าว 71" \
          , "บาดพร้าว 83", "มหาดไทย", "ลาดพร้าว 101", "บางกะปิ", "แยกลำสาลี", "ศรีกรีฑา" \
          , ("หัวหมาก สายเหลือง", "หัวหมาก สายแดง"), "กลันตัน", "ศรีนุช", "ศรีนครินทร์ 38" \
          , "สวนหลวง ร.9", "ศรีอุดม", "ศรีเอี่ยม", "ศรีลาซาล", "ศรีแบริ่ง", "ศรีด่าน", "ศรีเทพา" \
          , "ทัพวัล", ("สำโรง สายเหลือง", "สำโรง สายเขียว")]

black = [("พญาไทย สายดำ", "พญาไทย สายเขียว"), "ราชปรารภ", ("มักกะสัน", "เพชรบุรี"), "รามคำแหง" \
         , ("หัวหมาก สายดำ", "หัวหมาก สายเหลือง"), "บ้านทับช้าง", "ลาดกระบัง", "สุวรรณภูมิ"]

#รวบรวมว่าสายใน dict ที่เป็น key ติดกับสายอะไรบ้าง โดยให้เป็น value
line = {
  "blueline" : {"rightredline", "leftredline", "lightblueline", "purpleline", "greenline"},
  "lightblueline" : {"blueline", "greenline", "orangeline"},
  "orangeline" : {"lightblueline"},
  "littleyellowline" : {"lightblueline"},
  "purpleblueline" : {"pinkline", "leftredline", "blueline"},
  "leftredblueline" : {"purpleline", "blueline"},
  "rightredblueline" : {"pinkline", "blueline"},
  "greenblueline" : {"pinkline", "blueline", "blackline", "lightblueline", "yellowline"},
  "pinkblueline" : {"purpleline", "redline", "greenline"},
  "yellowblueline" : {"blueline", "blackline", "greenline"},
  "blackblueline" : {"blueline", "greenline", "yellowline"},
}

#นำ input ที่เข้ามา มาตรวจสอบก่อนว่าอยู่ใน list ของอะไร แล้วคืนค่ากลับไปเป็นชื่อสี
def find_color_of_station(station_name):
    """A function is used to find the color of station that user fill in"""
    if station_name in blue:
        return "blue"
    elif station_name in lightblue:
        return "light Blue"
    elif station_name in orange:
        return "orange"
    elif station_name in littleyellow:
        return "little Yellow"
    elif station_name in purple:
        return "purple"
    elif station_name in leftred:
        return "left red"
    elif station_name in rightred:
        return "right red"
    elif station_name in green:
        return "green"
    elif station_name in pink:
        return "pink"
    elif station_name in yellow:
        return "yellow"
    elif station_name in black:
        return "black"
    else:
        return "Station not found"

#รับ input ไปแล้วนำไปตรวจกับฟังก์ชัน main แล้วจึงไปตรวจสอบกับเงื่อนไขแล้วแสดง output
user_selected_station = input("กรุณาใส่ชื่อสถานีที่คุณต้องการไป: ")
station_color = find_color_of_station(user_selected_station)
if station_color != "Station not found":
    print("สถานี '{}' อยู่ในสายสี {}".format(user_selected_station, station_color))
else:
    print("ไม่พบสถานีที่คุณระบุ")
